ceph/compaire/cephfs_iodepth64.log
4k_randwrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
4k_randread: (g=1): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
64k_write: (g=2): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=64
...
64k_read: (g=3): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=64
...
fio-3.7
Starting 16 processes
4k_randwrite: Laying out IO file (1 file / 5120MiB)
4k_randwrite: Laying out IO file (1 file / 5120MiB)
4k_randwrite: Laying out IO file (1 file / 5120MiB)

4k_randwrite: (groupid=0, jobs=4): err= 0: pid=14654: Wed Aug 19 11:21:42 2020
  write: IOPS=3817, BW=14.9MiB/s (15.6MB/s)(449MiB/30144msec)
    slat (usec): min=3, max=4957, avg=25.51, stdev=37.92
    clat (usec): min=682, max=1125.4k, avg=67001.09, stdev=96538.10
     lat (usec): min=689, max=1125.4k, avg=67026.92, stdev=96539.33
    clat percentiles (usec):
     |  1.00th=[   1614],  5.00th=[   2057], 10.00th=[   2409],
     | 20.00th=[   3228], 30.00th=[   4293], 40.00th=[   6063],
     | 50.00th=[  12387], 60.00th=[  28705], 70.00th=[  61080],
     | 80.00th=[ 162530], 90.00th=[ 214959], 95.00th=[ 256902],
     | 99.00th=[ 341836], 99.50th=[ 387974], 99.90th=[ 666895],
     | 99.95th=[ 918553], 99.99th=[1082131]
   bw (  KiB/s): min= 1871, max=20179, per=24.52%, avg=3743.70, stdev=2208.26, samples=240
   iops        : min=  467, max= 5044, avg=935.53, stdev=552.06, samples=240
  lat (usec)   : 750=0.01%, 1000=0.02%
  lat (msec)   : 2=4.29%, 4=23.49%, 10=20.27%, 20=6.83%, 50=13.18%
  lat (msec)   : 100=4.83%, 250=21.56%, 500=5.31%, 750=0.14%, 1000=0.05%
  cpu          : usr=0.51%, sys=2.38%, ctx=61031, majf=0, minf=37
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,115065,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
4k_randread: (groupid=1, jobs=4): err= 0: pid=14974: Wed Aug 19 11:21:42 2020
   read: IOPS=1197, BW=4791KiB/s (4906kB/s)(147MiB/31414msec)
    slat (usec): min=3, max=139, avg=21.64, stdev= 8.77
    clat (usec): min=501, max=3970.9k, avg=213412.44, stdev=485736.36
     lat (usec): min=517, max=3970.9k, avg=213434.49, stdev=485736.69
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    4], 10.00th=[    5], 20.00th=[    8],
     | 30.00th=[   10], 40.00th=[   13], 50.00th=[   19], 60.00th=[   31],
     | 70.00th=[   70], 80.00th=[  243], 90.00th=[  735], 95.00th=[ 1150],
     | 99.00th=[ 2433], 99.50th=[ 2970], 99.90th=[ 3809], 99.95th=[ 3910],
     | 99.99th=[ 3977]
   bw (  KiB/s): min=    7, max= 2110, per=20.99%, avg=1005.53, stdev=443.75, samples=239
   iops        : min=    1, max=  527, avg=251.04, stdev=110.97, samples=239
  lat (usec)   : 750=0.07%, 1000=0.57%
  lat (msec)   : 2=0.32%, 4=5.54%, 10=25.95%, 20=19.36%, 50=15.04%
  lat (msec)   : 100=6.09%, 250=7.28%, 500=6.37%, 750=3.78%, 1000=2.90%
  cpu          : usr=0.25%, sys=0.84%, ctx=36740, majf=0, minf=293
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.2%, 32=0.3%, >=64=99.3%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=37629,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
64k_write: (groupid=2, jobs=4): err= 0: pid=15720: Wed Aug 19 11:21:42 2020
  write: IOPS=10.7k, BW=667MiB/s (700MB/s)(19.6GiB/30029msec)
    slat (usec): min=4, max=15006, avg=21.33, stdev=56.28
    clat (usec): min=902, max=328034, avg=23929.18, stdev=31628.14
     lat (usec): min=915, max=328045, avg=23950.71, stdev=31629.64
    clat percentiles (usec):
     |  1.00th=[  1893],  5.00th=[  2769], 10.00th=[  3556], 20.00th=[  4948],
     | 30.00th=[  6390], 40.00th=[  8094], 50.00th=[ 10159], 60.00th=[ 13435],
     | 70.00th=[ 19792], 80.00th=[ 37487], 90.00th=[ 69731], 95.00th=[ 93848],
     | 99.00th=[143655], 99.50th=[162530], 99.90th=[202376], 99.95th=[221250],
     | 99.99th=[325059]
   bw (  KiB/s): min=67147, max=279414, per=23.03%, avg=157374.32, stdev=40949.21, samples=236
   iops        : min= 1049, max= 4365, avg=2458.48, stdev=639.85, samples=236
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=1.32%, 4=11.78%, 10=35.94%, 20=21.05%, 50=14.63%
  lat (msec)   : 100=11.09%, 250=4.16%, 500=0.03%
  cpu          : usr=1.73%, sys=4.71%, ctx=122281, majf=0, minf=41
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,320684,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
64k_read: (groupid=3, jobs=4): err= 0: pid=16030: Wed Aug 19 11:21:42 2020
   read: IOPS=4249, BW=266MiB/s (279MB/s)(7984MiB/30060msec)
    slat (usec): min=3, max=969, avg=18.17, stdev=17.76
    clat (usec): min=550, max=2626.9k, avg=60187.07, stdev=145478.52
     lat (usec): min=560, max=2626.0k, avg=60205.50, stdev=145479.29
    clat percentiles (usec):
     |  1.00th=[    807],  5.00th=[   1434], 10.00th=[   2212],
     | 20.00th=[   4359], 30.00th=[   6980], 40.00th=[  10028],
     | 50.00th=[  13566], 60.00th=[  21627], 70.00th=[  44303],
     | 80.00th=[  84411], 90.00th=[ 149947], 95.00th=[ 246416],
     | 99.00th=[ 608175], 99.50th=[ 784335], 99.90th=[2399142],
     | 99.95th=[2533360], 99.99th=[2634023]
   bw (  KiB/s): min=  256, max=171264, per=25.51%, avg=69388.94, stdev=38507.12, samples=235
   iops        : min=    4, max= 2676, avg=1084.12, stdev=601.67, samples=235
  lat (usec)   : 750=0.49%, 1000=1.99%
  lat (msec)   : 2=6.08%, 4=9.97%, 10=21.42%, 20=18.77%, 50=12.73%
  lat (msec)   : 100=11.98%, 250=11.65%, 500=3.64%, 750=0.69%, 1000=0.19%
  cpu          : usr=0.53%, sys=2.34%, ctx=117015, majf=0, minf=2092
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=127751,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=14.9MiB/s (15.6MB/s), 14.9MiB/s-14.9MiB/s (15.6MB/s-15.6MB/s), io=449MiB (471MB), run=30144-30144msec

Run status group 1 (all jobs):
   READ: bw=4791KiB/s (4906kB/s), 4791KiB/s-4791KiB/s (4906kB/s-4906kB/s), io=147MiB (154MB), run=31414-31414msec

Run status group 2 (all jobs):
  WRITE: bw=667MiB/s (700MB/s), 667MiB/s-667MiB/s (700MB/s-700MB/s), io=19.6GiB (21.0GB), run=30029-30029msec

Run status group 3 (all jobs):
   READ: bw=266MiB/s (279MB/s), 266MiB/s-266MiB/s (279MB/s-279MB/s), io=7984MiB (8372MB), run=30060-30060msec